# <span style="color:#0f4c75"> <center> Progetto di Foundations of Computer Science - AA 2019/2020 </center>

> <span style="color:#0f4c75">**Studente**:</span> Campironi Matteo
>
> <span style="color:#3282b8">**Matricola**:</span> 801850

> <span style="color:#0f4c75">**Studente**:</span> Di Maggio Serena
> 
> <span style="color:#3282b8">**Matricola**:</span> 821063

***

### <span style="color:#0f4c75">  Importo le librerie necessarie

In [1]:
import pandas as pd
import numpy as np
import re
import autotime
import datetime as dt
pd.set_option('display.max_columns', None)
pd.options.display.float_format = '{:.4f}'.format

In [2]:
%load_ext autotime
start = dt.datetime.now()

### <span style="color:#0f4c75"> Leggo i file CSV

In [3]:
df = pd.read_csv(r"/Users/serenadimaggio/Desktop/progettoCoSc/loans_lenders.csv")

time: 3.44 s

In [4]:
df.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

time: 17 ms

In [5]:
loans = pd.read_csv(r"/Users/serenadimaggio/Desktop/progettoCoSc/loans.csv")

time: 32.6 s

In [6]:
loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0000,125.0000,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1000,PHP,126.0000,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2014-01-15 04:48:22.000 +0000,7.0000,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0000,400.0000,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1000,HNL,201.0000,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2014-02-25 06:42:06.000 +0000,8.0000,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0000,400.0000,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1000,PKR,245.0000,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,2014-01-24 23:06:18.000 +0000,14.0000,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0000,625.0000,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1000,KGS,171.0000,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,2014-01-22 05:29:28.000 +0000,14.0000,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0000,425.0000,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1000,PHP,123.0000,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,2014-01-14 17:29:27.000 +0000,7.0000,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner

time: 44.1 ms

In [7]:
lenders = pd.read_csv(r"/Users/serenadimaggio/Desktop/progettoCoSc/lenders.csv")

time: 4.99 s

In [8]:
lenders.head()

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,NaN,1461300457,NaN,NaN,1.0000,NaN,0
1,reena6733,Reena,NaN,NaN,NaN,1461300634,NaN,NaN,9.0000,NaN,0
2,mai5982,Mai,NaN,NaN,NaN,1461300853,NaN,NaN,nan,NaN,0
3,andrew86079135,Andrew,NaN,NaN,NaN,1461301091,NaN,NaN,5.0000,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,NaN,1461301154,NaN,NaN,nan,NaN,0

time: 27.1 ms

In [9]:
country_stats = pd.read_csv(r"/Users/serenadimaggio/Desktop/progettoCoSc/country_stats.csv")

time: 18.9 ms

In [10]:
country_stats.head()

,country_name,country_code,country_code3,continent,region,population,population_below_poverty_line,hdi,life_expectancy,expected_years_of_schooling,mean_years_of_schooling,gni,kiva_country_name
0,India,IN,IND,Asia,Southern Asia,1339180127,21.9000,0.6236,68.3220,11.6966,6.2988,5663.4748,India
1,Nigeria,NG,NGA,Africa,Western Africa,190886311,70.0000,0.5271,53.0570,9.9705,6.0000,5442.9013,Nigeria
2,Mexico,MX,MEX,Americas,Central America,129163276,46.2000,0.7617,76.9720,13.2991,8.5550,16383.1067,Mexico
3,Pakistan,PK,PAK,Asia,Southern Asia,197015955,29.5000,0.5504,66.3650,8.1069,5.0895,5031.1731,Pakistan
4,Bangladesh,BD,BGD,Asia,Southern Asia,164669751,31.5000,0.5788,71.9850,10.1787,5.2416,3341.4907,Bangladesh

time: 52.2 ms

***

###  <span style="color:#3282b8">1. Normalize the *loan_lenders* table. In the normalized table, each row must have one *loan_id* and one *lender*.

In [11]:
df = df.set_index('loan_id')['lenders'].str.split(pat=',').explode().reset_index()

time: 16.8 s

In [12]:
df.head()

   loan_id       lenders
0   483693        muc888
1   483693       sam4326
2   483693   camaran3922
3   483693   lachheb1865
4   483693   rebecca3499

time: 14.8 ms

***

###  <span style="color:#3282b8">2. For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing</span>

Si prende in considerazione il dataframe `loans`, che contiene `disburse_time` e `planned_expiration_time`. Non è possibile però trattarle direttamente come date, in quanto sono viste come strighe:

In [13]:
print(type(loans.disburse_time[0]))
print(type(loans.planned_expiration_time[0]))

<class 'str'>
<class 'str'>
time: 15 ms

Per questo si farà uso del metodo `to_datetime` per convertirli in date e riuscire a fare i conti agevolmente.

In [14]:
loans['duration'] = (pd.to_datetime(loans.disburse_time)-pd.to_datetime(loans.planned_expiration_time)).dt.days

time: 1.2 s

Quello che è possibile osservare è che compaiono valori di `duration` che sono minori di 0, il che implica che `disburse_time` sia precedente a `planned_expiration_time`. Leggendo la documentazione di Kiva:

- disburse_time: The date at which the funds from the loan were given to the borrowers. Note that it is possible for the money to be disbursed to borrowers before the loan is posted on Kiva.

Infatti secondo il sito di Kiva, non sempre i soldi non vengono trasferiti direttamente a chi li richiede, ma passano per delle organizzazioni chiamate <a href=https://www.kiva.org/about/where-kiva-works/partner>Field Partner</a>. Queste si occupano della gestione del denaro e, in caso di disponibilità, possono sborsare la somma del prestito anche prima che questa venga finanziata su Kiva. Ulteriori informazioni sono disponibili su: https://www.kiva.org/about/how

Di conseguenza verranno considerati come normali valori con `duration` negativa.

In [15]:
loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model,duration
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0000,125.0000,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1000,PHP,126.0000,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2014-01-15 04:48:22.000 +0000,7.0000,3,2,1,NaN,female,true,irregular,field_partner,-54.0000
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0000,400.0000,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1000,HNL,201.0000,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2014-02-25 06:42:06.000 +0000,8.0000,11,2,1,NaN,female,true,monthly,field_partner,-97.0000
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0000,400.0000,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1000,PKR,245.0000,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,2014-01-24 23:06:18.000 +0000,14.0000,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner,-38.0000
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0000,625.0000,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1000,KGS,171.0000,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,2014-01-22 05:29:28.000 +0000,14.0000,21,2,1,user_favorite,female,true,monthly,field_partner,-35.0000
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0000,425.0000,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1000,PHP,123.0000,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,2014-01-14 17:29:27.000 +0000,7.0000,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner,-58.0000

time: 32.3 ms

Inoltre è possibile osservare che se una tra `disburse_time` o `planned_expiration_time` è mancante, allora anche la rispettiva `duration` sarà mancante:

In [16]:
loans[(loans['disburse_time'].isna()) | (loans['planned_expiration_time'].isna())][['disburse_time','planned_expiration_time','duration']]

,disburse_time,planned_expiration_time,duration
64,2010-11-18 08:00:00.000 +0000,NaN,nan
65,2010-11-25 08:00:00.000 +0000,NaN,nan
66,2010-11-25 08:00:00.000 +0000,NaN,nan
67,2010-11-16 08:00:00.000 +0000,NaN,nan
69,2010-11-10 08:00:00.000 +0000,NaN,nan
...,...,...,...
1419523,2005-04-14 05:27:55.000 +0000,NaN,nan
1419524,NaN,2017-02-09 23:07:54.000 +0000,nan
1419525,NaN,2015-09-21 08:06:19.000 +0000,nan
1419538,NaN,2017-02-25 20:21:21.000 +0000,nan
1419564,NaN,2016-09-30 18:49:53.000 +0000,nan

time: 3.33 s

***

###  <span style="color:#3282b8">3. Find the lenders that have funded at least twice.</span>

Il dataframe `df` contiene i `loan_id` e i `lenders` che vi hanno partecipato. Si esegue quindi un groupby e si contano quante volte compaiono i lenders. Infine si considerano solamente quelli che hanno `num_of_fund` maggiore o uguale a 2.

In [17]:
fund = df.groupby(['lenders']).size().reset_index()
fund.columns = ['lenders', 'num_of_fund']

time: 16 s

In [18]:
fund[fund['num_of_fund'] >= 2].head()

           lenders  num_of_fund
0              000           39
1            00000           39
2             0002           70
4   0101craign0101           71
5          0132575            4

time: 105 ms

***

###  <span style="color:#3282b8">4. For each country, compute how many loans have involved that country as borrowers.</span>

Durante l'esplorazione del dataframe `loans` ci si è resi conto che emergevano 96 `country_name` contro i 95 `country_code`. Risulta infatti mancante quello della Namibia. <a href=https://en.wikipedia.org/wiki/ISO_3166-2:NA>Secondo lo standard ISO</a>, il codice per questo paese risulta essere `NA` e di conseguenza lo si inserisce nel dataframe.

In [19]:
loans[loans['country_code'].isnull()][['country_name','country_code']].head()

       country_name country_code
82889       Namibia          NaN
156970      Namibia          NaN
598087      Namibia          NaN
684876      Namibia          NaN
971827      Namibia          NaN

time: 72 ms

In [20]:
loans.country_code = loans.country_code.fillna('NA') #si è sicuri che ogni NaN corrisponda alla Namibia

time: 82.3 ms

In [21]:
loans[loans['country_code'].isnull()][['country_name','country_code']].head()

Empty DataFrame
Columns: [country_name, country_code]
Index: []

time: 56.9 ms

Il dataframe `loans` contiene tutti i prestiti, con le informazioni sul paese di origine di chi lo richiede. Di conseguenza se si esegue un groupby è possibile rispondere al quesito.

In [22]:
temp = loans.groupby(['country_name','country_code']).size().reset_index()
temp.columns = ['country_name','country_code','num_of_loans']
temp.head()

  country_name country_code  num_of_loans
0  Afghanistan           AF          2337
1      Albania           AL          3075
2      Armenia           AM         13952
3   Azerbaijan           AZ         10172
4       Belize           BZ           218

time: 191 ms

È possibile anche ordinare il dataframe per numero di prestiti:

In [23]:
temp.sort_values(by=['num_of_loans'], ascending = False).head()

   country_name country_code  num_of_loans
66  Philippines           PH        285336
40        Kenya           KE        143699
65         Peru           PE         86000
14     Cambodia           KH         79701
27  El Salvador           SV         64037

time: 10.4 ms

***

###  <span style="color:#3282b8">5. For each country, compute the overall amount of money borrowed.</span>

Prima di tutto si osserva che il prestito può assumere 4 diversi tipi di `status`:

In [24]:
loans['status'].value_counts()

funded         1350340
expired          59081
refunded          6578
fundRaising       3608
Name: status, dtype: int64

time: 126 ms

<a href=https://pages.kiva.org/blog/qa-expiring-loans-credit-limits-and-the-evolution-of-kiva>Dalla pagina Q&A di Kiva</a> è possibile osservare che:
- The loan profile remains on the site but shows up as “expired”.
- All lenders who have chipped in to fund the loan already are refunded.
- The Field Partner administering the loan doesn’t receive any of the funds.

Di conseguenza si è scelto di non considerare tutti i prestiti con `status == expired`.

In [25]:
money_borrowed = loans[loans['status'] != 'expired'][['country_name','country_code','loan_amount']].groupby(['country_name','country_code']).sum().reset_index()
money_borrowed.columns = ['country_name','country_code','money_borrowed']
money_borrowed

   country_name country_code  money_borrowed
0   Afghanistan           AF    1967950.0000
1       Albania           AL    3784350.0000
2       Armenia           AM   17878800.0000
3    Azerbaijan           AZ   13433200.0000
4        Belize           BZ     150175.0000
..          ...          ...             ...
90      Vanuatu           VU       9250.0000
91      Vietnam           VN   22393325.0000
92        Yemen           YE    3182900.0000
93       Zambia           ZM    1862600.0000
94     Zimbabwe           ZW    5826925.0000

[95 rows x 3 columns]

time: 7.27 s

***

###  <span style="color:#3282b8">6. Like the previous point, but expressed as a percentage of the overall amount lent.</span>

In [26]:
overall = money_borrowed['money_borrowed'].sum()
money_borrowed['percentage'] = money_borrowed['money_borrowed']/overall*100
money_borrowed

   country_name country_code  money_borrowed  percentage
0   Afghanistan           AF    1967950.0000      0.1803
1       Albania           AL    3784350.0000      0.3468
2       Armenia           AM   17878800.0000      1.6384
3    Azerbaijan           AZ   13433200.0000      1.2310
4        Belize           BZ     150175.0000      0.0138
..          ...          ...             ...         ...
90      Vanuatu           VU       9250.0000      0.0008
91      Vietnam           VN   22393325.0000      2.0521
92        Yemen           YE    3182900.0000      0.2917
93       Zambia           ZM    1862600.0000      0.1707
94     Zimbabwe           ZW    5826925.0000      0.5340

[95 rows x 4 columns]

time: 229 ms

***

###  <span style="color:#3282b8">7. Like the three previous points, but split for each year (with respect to disburse time).

####  <span style="color:#0f4c75">Punto 4

In [27]:
loans['disburse_year'] = pd.to_datetime(loans['disburse_time']).dt.year

time: 384 ms

In [28]:
temp_year = loans.groupby(['country_name','country_code', 'disburse_year']).size()
temp_year = pd.DataFrame(temp_year)
temp_year.head(10)

                                           0
country_name country_code disburse_year
Afghanistan  AF           2007.0000      408
                          2008.0000      370
                          2009.0000      678
                          2010.0000      632
                          2011.0000      247
                          2015.0000        1
                          2016.0000        1
Albania      AL           2012.0000      332
                          2013.0000      507
                          2014.0000      603

time: 385 ms

####  <span style="color:#0f4c75">Punto 5

In [29]:
temp2 = loans[loans['status'] != 'expired'][['country_name','country_code','disburse_year','loan_amount']].groupby(['country_name','country_code', 'disburse_year']).sum()
temp2.head(10)

                                         loan_amount
country_name country_code disburse_year
Afghanistan  AF           2007.0000      194975.0000
                          2008.0000      365375.0000
                          2009.0000      585125.0000
                          2010.0000      563350.0000
                          2011.0000      245125.0000
                          2015.0000        6000.0000
                          2016.0000        8000.0000
Albania      AL           2012.0000      413000.0000
                          2013.0000      770650.0000
                          2014.0000      818300.0000

time: 984 ms

####  <span style="color:#0f4c75">Punto 6

In [30]:
temp2['percentage'] = temp2['loan_amount']/overall*100
temp2.head(10)

                                         loan_amount  percentage
country_name country_code disburse_year
Afghanistan  AF           2007.0000      194975.0000      0.0179
                          2008.0000      365375.0000      0.0335
                          2009.0000      585125.0000      0.0536
                          2010.0000      563350.0000      0.0516
                          2011.0000      245125.0000      0.0225
                          2015.0000        6000.0000      0.0005
                          2016.0000        8000.0000      0.0007
Albania      AL           2012.0000      413000.0000      0.0378
                          2013.0000      770650.0000      0.0706
                          2014.0000      818300.0000      0.0750

time: 10.1 ms

***

###  <span style="color:#3282b8"> 8. For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount.

Si considerano i dataframe `df` che contiene tutti i `loan_id` con i rispettivi `lenders` e `loans`, che contiene `funded_amount`. 

Si effettua quindi una left join:

In [31]:
loan_lent = pd.merge(df, loans[loans['status'] != 'expired'][['loan_id','funded_amount']], how='left', on='loan_id')
loan_lent.head()

   loan_id       lenders  funded_amount
0   483693        muc888      1225.0000
1   483693       sam4326      1225.0000
2   483693   camaran3922      1225.0000
3   483693   lachheb1865      1225.0000
4   483693   rebecca3499      1225.0000

time: 11.8 s

Vengono riscontrati numerosi NaN in `funded_amount` (precisamente 1007322). Di questi prestiti non si può dire nulla, ma si è deciso di lasciarli.

In [32]:
loan_lent[loan_lent['funded_amount'].isna()].head()

      loan_id          lenders  funded_amount
7250   567453       romans14v7            nan
7251   567453    susie28375788            nan
7252   567453       julian8731            nan
7253   567453   angela81839441            nan
7254   567453         sota4018            nan

time: 365 ms

Dal momento che solitamente in un prestito contribuiscono più persone, sarebbe necessario sapere quanto ha sborsato ogni utente. Il dataset non comprende questa informazione, di conseguenza si contano quante persone hanno partecipato al prestito e si divide la somma totale in parti uguali.

In [33]:
loan_lent = pd.merge(loan_lent, loan_lent.groupby('loan_id')['lenders'].count(), how='left', on='loan_id')
loan_lent.columns = ['loan_id', 'lenders', 'loan_amount','count']
loan_lent.head()

   loan_id       lenders  loan_amount  count
0   483693        muc888    1225.0000     40
1   483693       sam4326    1225.0000     40
2   483693   camaran3922    1225.0000     40
3   483693   lachheb1865    1225.0000     40
4   483693   rebecca3499    1225.0000     40

time: 10.5 s

Si crea la colonna `ind_share` (individual share).

In [34]:
loan_lent['ind_share'] = loan_lent['loan_amount']/loan_lent['count']

time: 441 ms

Infine con un groupby si trova quanto ha sborsato ogni utente nella piattaforma Kiva.

In [35]:
money_lent = loan_lent.groupby('lenders')['ind_share'].sum().reset_index()
money_lent.head()

           lenders  ind_share
0              000  1672.6184
1            00000  1379.7502
2             0002  2472.5636
3         00mike00    52.6316
4   0101craign0101  2623.5651

time: 15.2 s

***

###  <span style="color:#3282b8"> 9. For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed.

####  <span style="color:#0f4c75">Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.

Come visto precedentemente, il dataframe `lenders` contiene le informazioni riguardanti ogni utente. L'informazione utile per il quesito è la nazionalità, quindi `country_code`. Il problema è che su 2349174 righe, 1458635 sono NaN (circa il 62%).

In [36]:
lenders[lenders['country_code'].isna()]

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,NaN,1461300457,NaN,NaN,1.0000,NaN,0
1,reena6733,Reena,NaN,NaN,NaN,1461300634,NaN,NaN,9.0000,NaN,0
2,mai5982,Mai,NaN,NaN,NaN,1461300853,NaN,NaN,nan,NaN,0
3,andrew86079135,Andrew,NaN,NaN,NaN,1461301091,NaN,NaN,5.0000,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,NaN,1461301154,NaN,NaN,nan,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
2349167,todd5695,Todd,NaN,NaN,NaN,1342101461,NaN,NaN,nan,NaN,0
2349168,kate40761039,Kate,NaN,NaN,NaN,1342096938,NaN,NaN,1.0000,Irina,0
2349169,janet7309,Janet,NaN,NaN,NaN,1342097163,NaN,NaN,nan,NaN,0
2349170,pj4198,NaN,NaN,NaN,NaN,1342097515,NaN,NaN,nan,NaN,0
2349172,simone9846,Simone,NaN,NaN,NaN,1342100213,NaN,NaN,nan,NaN,0

time: 1.4 s

Come suggerito, si cerca quindi la distribuzione dei paesi sulla base di quelli conosciuti. Si crea quindi un dataframe `countries` che conta quanti lenders sono originari di un determinato paese.

In [37]:
countries = lenders['country_code'].dropna().reset_index()
countries = countries.groupby('country_code').size().reset_index() 
countries.columns = ['country_code', 'num'] #vengono rinominate le colonne per rendere tutto più ordinato
countries.head()

  country_code   num
0           AD    15
1           AE  1043
2           AF   228
3           AG     8
4           AI     4

time: 221 ms

Se ne calcola quindi la distribuzione, dividendo il numero di utenti di una determinata nazionalità per il totale.

In [38]:
countries['distribution'] = countries['num']/countries['num'].sum()
countries.head(10)

  country_code   num  distribution
0           AD    15        0.0000
1           AE  1043        0.0012
2           AF   228        0.0003
3           AG     8        0.0000
4           AI     4        0.0000
5           AL    96        0.0001
6           AM    93        0.0001
7           AN    35        0.0000
8           AO    38        0.0000
9           AQ    26        0.0000

time: 10.1 ms

Dal momento che verranno utilizzati i dataframe `countries` e `money_borrowed` (creato nel punto 5) ci si chiede se vi è qualche discrepanza tra i `country_code`

In [39]:
for country in money_borrowed['country_code']:
    if ~countries['country_code'].str.contains(country).any():
        print(country)

TD
NA
time: 68.3 ms

È possibile osservare che la Namibia (NA) e il Chad (TD) non compaiono tra le nazioni che hanno prestato denaro. Vengono aggiunte per completezza:

In [40]:
countries = countries.append(pd.DataFrame({"country_code":['NA', 'TD'], "num":[0, 0], "distribution":[0,0]})).reset_index(drop=1)

time: 4.92 ms

####  <span style="color:#0f4c75">Money lent

Nel punto 8 era stato creato il dataframe `money_lent`, che contiene i soldi prestati da ogni utente di Kiva. Facendone un merge con `lenders`, se ne ottiene anche la nazionalità (quelle che sono presenti).

In [41]:
temp = pd.merge(money_lent,lenders[['permanent_name','country_code']],how='left', left_on=['lenders'],right_on=['permanent_name']).drop(columns=['permanent_name'])
temp.head()

           lenders  ind_share country_code
0              000  1672.6184          NaN
1            00000  1379.7502          NaN
2             0002  2472.5636          NaN
3         00mike00    52.6316          NaN
4   0101craign0101  2623.5651          NaN

time: 4.85 s

Inizialmente si considerino solo gli utenti di cui si conosce la nazionalità. Si eliminano quindi tutte le righe con valore NaN e si effettua un groupby per `country_code` sommando le righe, in modo da ricavare la quantità di soldi prestata per ogni paese.

In [42]:
temp2 = temp.dropna(subset=['country_code'])
temp2 = temp2.groupby('country_code').sum().reset_index()
temp2.head()

  country_code   ind_share
0           AD    115.1515
1           AE 101302.4818
2           AF   5433.3261
3           AL    732.2944
4           AM    379.4789

time: 199 ms

Per quanto riguarda gli utenti con nazionalità sconosciuta, si calcola il totale dei soldi prestati e lo di ridistribuisce ai vari paese in base alla distribuzione calcolata precedentemente.

In [43]:
tot = temp[temp['country_code'].isna()]['ind_share'].sum()
tot

1019317175.8003209

time: 242 ms

In [44]:
countries['tot_lent_NaN'] = tot*countries['distribution']
countries.head()

  country_code   num  distribution  tot_lent_NaN
0           AD    15        0.0000    17169.1050
1           AE  1043        0.0012  1193825.1041
2           AF   228        0.0003   260970.3967
3           AG     8        0.0000     9156.8560
4           AI     4        0.0000     4578.4280

time: 12.4 ms

In [45]:
temp2 = pd.merge(countries[['country_code','tot_lent_NaN']], temp2, how='left', on='country_code')
temp2.columns=['country_code','mon_lent_NaN','mon_lent_known']
temp2 = temp2.fillna(0)
temp2.head()

  country_code  mon_lent_NaN  mon_lent_known
0           AD    17169.1050        115.1515
1           AE  1193825.1041     101302.4818
2           AF   260970.3967       5433.3261
3           AG     9156.8560          0.0000
4           AI     4578.4280          0.0000

time: 20 ms

In [46]:
temp2['money_lent'] = temp2['mon_lent_NaN']+temp2['mon_lent_known']
temp2 = temp2.drop(columns = ['mon_lent_NaN','mon_lent_known'])
temp2.head()

  country_code   money_lent
0           AD   17284.2566
1           AE 1295127.5858
2           AF  266403.7227
3           AG    9156.8560
4           AI    4578.4280

time: 12.5 ms

####  <span style="color:#0f4c75">Money borrowed

Nel punto 5 era stato calcolato il dataframe `money_borrowed`, che contiene i soldi prestati da ogni paese. Basterà quindi effettuare un merge:

In [47]:
temp2 = pd.merge(temp2, money_borrowed[['country_code','money_borrowed']], how='left', on='country_code')
temp2.head()

  country_code   money_lent  money_borrowed
0           AD   17284.2566             nan
1           AE 1295127.5858             nan
2           AF  266403.7227    1967950.0000
3           AG    9156.8560             nan
4           AI    4578.4280             nan

time: 13.9 ms

È possibile infine calcolare la differenza:

In [48]:
temp2['difference'] = temp2['money_lent']-temp2['money_borrowed']
temp2

    country_code   money_lent  money_borrowed    difference
0             AD   17284.2566             nan           nan
1             AE 1295127.5858             nan           nan
2             AF  266403.7227    1967950.0000 -1701546.2773
3             AG    9156.8560             nan           nan
4             AI    4578.4280             nan           nan
..           ...          ...             ...           ...
231           ZA 1224671.5490    1006525.0000   218146.5490
232           ZM   74651.6691    1862600.0000 -1787948.3309
233           ZW   61808.7782    5826925.0000 -5765116.2218
234           NA       0.0000      39525.0000   -39525.0000
235           TD       0.0000      20075.0000   -20075.0000

[236 rows x 4 columns]

time: 16.7 ms

Si osserva che in realtà non è possibile calcolare la differenza di ogni paese: nel punto 5 si erano trovati valori di `money_borrowed` per solo 95 paesi. Si è preferito lasciare i valori mancanti come NaN, in quanto non si sa se i soldi prestati siano 0 oppure se sia un valore mancante.

In [49]:
temp2.dropna()

    country_code   money_lent  money_borrowed     difference
2             AF  266403.7227    1967950.0000  -1701546.2773
5             AL  110614.5667    3784350.0000  -3673735.4333
6             AM  106827.9302   17878800.0000 -17771972.0698
15            AZ   44822.0770   13433200.0000 -13388377.9230
16            BA   78133.8311     477250.0000   -399116.1689
..           ...          ...             ...            ...
231           ZA 1224671.5490    1006525.0000    218146.5490
232           ZM   74651.6691    1862600.0000  -1787948.3309
233           ZW   61808.7782    5826925.0000  -5765116.2218
234           NA       0.0000      39525.0000    -39525.0000
235           TD       0.0000      20075.0000    -20075.0000

[95 rows x 4 columns]

time: 15.9 ms

Eliminando i NaN ritroviamo i 95 paesi del punto 5, facendo attenzione a come sono stati trattati NA e TD, che, per coerenza con quanto detto prima, dovrebbero essere posti come NaN.

In [50]:
temp2.loc[temp2['country_code'] == 'NA', 'difference'] = None
temp2.loc[temp2['country_code'] == 'TD', 'difference'] = None

time: 16.4 ms

***

###  <span style="color:#3282b8"> 10. Which country has the highest ratio between the difference computed at the previous point and the population?

Nel dataset `country_stats` si trovano informazioni riguardanti i vari paesi. Utilizziamo quindi il risultato del punto precedente, eliminando i NaN in quanto inutili per calcolare il `ratio`. 

(Un'altra scelta sarebbe stata quella di porre a 0 i valori come discusso nel punto precedente, ma sarebbe cambiato il risultato in questo caso).

In [51]:
temp2 = pd.merge(temp2[['country_code','difference']].dropna(), country_stats[['country_code','population','population_below_poverty_line']], how='left', on='country_code')
temp2['ratio'] = temp2['difference']/temp2['population']
temp2

,country_code,difference,population,population_below_poverty_line,ratio
0,AF,-1701546.2773,35530081.0000,35.8000,-0.0479
1,AL,-3673735.4333,2930187.0000,14.3000,-1.2538
2,AM,-17771972.0698,2930450.0000,32.0000,-6.0646
3,AZ,-13388377.9230,9827589.0000,4.9000,-1.3623
4,BA,-399116.1689,3507017.0000,17.2000,-0.1138
...,...,...,...,...,...
88,XK,-2595440.6194,1895250.0000,30.0000,-1.3694
89,YE,-2954850.6221,28250420.0000,54.0000,-0.1046
90,ZA,218146.5490,56717156.0000,16.6000,0.0038
91,ZM,-1787948.3309,17094130.0000,60.5000,-0.1046
92,ZW,-5765116.2218,16529904.0000,72.3000,-0.3488

time: 25.9 ms

In [52]:
temp2[temp2.population.isna()]

   country_code  difference  population  population_below_poverty_line  ratio
29           GU  26899.4469         nan                            nan    nan
30           GZ   7590.6770         nan                            nan    nan
84           VC -36602.5048         nan                            nan    nan
86           VU  28167.6203         nan                            nan    nan

time: 13.5 ms

Come è possibile osservare, di 4 dei 95 paesi non è stato possibile calcolare `ratio` in quanto manca il dato riguardante la popolazione. Dal momento che sono pochi, è possibile inserirli manualmente:

- <a href=https://en.wikipedia.org/wiki/Guam>GU</a> (Guam)
- <a href=https://en.wikipedia.org/wiki/Gaza_Strip>GZ</a> (Gaza Strip)
- <a href=https://en.wikipedia.org/wiki/Saint_Vincent_and_the_Grenadines>VC</a> (Saint Vincent)
- <a href=https://en.wikipedia.org/wiki/Vanuatu>GU</a> (Vanuatu)

In [53]:
temp2.loc[90,'population'] = 162742
temp2.loc[91,'population'] = 1850000
temp2.loc[92,'population'] = 110211
temp2.loc[93,'population'] = 272459
temp2['ratio'] = temp2['difference']/temp2['population']
temp2

,country_code,difference,population,population_below_poverty_line,ratio
0,AF,-1701546.2773,35530081.0000,35.8000,-0.0479
1,AL,-3673735.4333,2930187.0000,14.3000,-1.2538
2,AM,-17771972.0698,2930450.0000,32.0000,-6.0646
3,AZ,-13388377.9230,9827589.0000,4.9000,-1.3623
4,BA,-399116.1689,3507017.0000,17.2000,-0.1138
...,...,...,...,...,...
89,YE,-2954850.6221,28250420.0000,54.0000,-0.1046
90,ZA,218146.5490,162742.0000,16.6000,1.3404
91,ZM,-1787948.3309,1850000.0000,60.5000,-0.9665
92,ZW,-5765116.2218,110211.0000,72.3000,-52.3098
93,NaN,nan,272459.0000,nan,nan

time: 16 ms

Se si considera il `ratio` con il segno, allora il paese con quello più alto è il Canada (CA). Se invece lo si considera in valore assoluto, la risposta è Samoa (WS).

In [54]:
temp2.dropna(subset=['ratio']).sort_values("ratio", ascending=False).head()

,country_code,difference,population,population_below_poverty_line,ratio
14,CA,81897109.0366,36624199.0000,9.4000,2.2361
82,US,678219500.7544,324459463.0000,15.1000,2.0903
90,ZA,218146.5490,162742.0000,16.6000,1.3404
41,LA,1663047.3451,6858160.0000,22.0000,0.2425
6,BG,245748.9524,7084571.0000,22.0000,0.0347

time: 15 ms

In [55]:
temp2.dropna(subset=['ratio']).sort_values("ratio", ascending=True).head()

,country_code,difference,population,population_below_poverty_line,ratio
87,WS,-11015834.3230,196440.0000,nan,-56.0773
92,ZW,-5765116.2218,110211.0000,72.3000,-52.3098
65,PY,-53404341.8661,6811297.0000,22.2000,-7.8406
2,AM,-17771972.0698,2930450.0000,32.0000,-6.0646
73,SV,-34147299.2752,6377853.0000,34.9000,-5.3540

time: 14.2 ms

***

###  <span style="color:#3282b8"> 11. Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?

La colonna `population_below_poverty_line` esprime la percentuale della popolazione che è sotto la soglia di povertà. Dal momento che il quesito richiede quella che non è sotto la soglia, si considera la percentuale complementare:

$\text{ratio} = \frac{\text{diff}}{\frac{(100-\text{pop_below})}{100}\text{pop}} $

In [56]:
temp2['ratio_not_poverty'] = 100*temp2['difference']/((100-temp2['population_below_poverty_line'])*temp2['population'])
temp2

,country_code,difference,population,population_below_poverty_line,ratio,ratio_not_poverty
0,AF,-1701546.2773,35530081.0000,35.8000,-0.0479,-0.0746
1,AL,-3673735.4333,2930187.0000,14.3000,-1.2538,-1.4630
2,AM,-17771972.0698,2930450.0000,32.0000,-6.0646,-8.9185
3,AZ,-13388377.9230,9827589.0000,4.9000,-1.3623,-1.4325
4,BA,-399116.1689,3507017.0000,17.2000,-0.1138,-0.1374
...,...,...,...,...,...,...
89,YE,-2954850.6221,28250420.0000,54.0000,-0.1046,-0.2274
90,ZA,218146.5490,162742.0000,16.6000,1.3404,1.6072
91,ZM,-1787948.3309,1850000.0000,60.5000,-0.9665,-2.4467
92,ZW,-5765116.2218,110211.0000,72.3000,-52.3098,-188.8441
93,NaN,nan,272459.0000,nan,nan,nan

time: 19.5 ms

Se si considera il `ratio_not_poverty` con il segno, allora il paese con quello più alto è il Canada (CA). Se invece lo si considera in valore assoluto, la risposta è lo Zimbabwe (ZW).

In [57]:
temp2.dropna(subset=['ratio_not_poverty']).sort_values("ratio_not_poverty", ascending=False).head()

,country_code,difference,population,population_below_poverty_line,ratio,ratio_not_poverty
14,CA,81897109.0366,36624199.0000,9.4000,2.2361,2.4682
82,US,678219500.7544,324459463.0000,15.1000,2.0903,2.4621
90,ZA,218146.5490,162742.0000,16.6000,1.3404,1.6072
41,LA,1663047.3451,6858160.0000,22.0000,0.2425,0.3109
6,BG,245748.9524,7084571.0000,22.0000,0.0347,0.0445

time: 13.3 ms

In [58]:
temp2.dropna(subset=['ratio_not_poverty']).sort_values("ratio_not_poverty", ascending=True).head()

,country_code,difference,population,population_below_poverty_line,ratio,ratio_not_poverty
92,ZW,-5765116.2218,110211.0000,72.3000,-52.3098,-188.8441
65,PY,-53404341.8661,6811297.0000,22.2000,-7.8406,-10.0778
2,AM,-17771972.0698,2930450.0000,32.0000,-6.0646,-8.9185
73,SV,-34147299.2752,6377853.0000,34.9000,-5.3540,-8.2243
56,NI,-27620847.0565,6217581.0000,29.6000,-4.4424,-6.3102

time: 15.5 ms

***

###  <span style="color:#3282b8">12. For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year.

####  <span style="color:#0f4c75"> For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.

Come è possibile osservare nell'esempio, per rispondere al quesito è necessario che `disburse_time` sia precedente al `planned_expiration_time`, ossia che `duration` sia < 0. Inoltre non deve essere NaN:

In [59]:
loans_reduced = loans[loans['duration'] < 0][['loan_amount','disburse_time','planned_expiration_time']].reset_index(drop=1)
loans_reduced[['planned_expiration_time','disburse_time']] = loans_reduced[['planned_expiration_time','disburse_time']].apply(pd.to_datetime)
loans_reduced['disburse_year'] = loans_reduced['disburse_time'].dt.year
loans_reduced['planned_expiration_year'] = loans_reduced['planned_expiration_time'].dt.year
loans_reduced.head()

,loan_amount,disburse_time,planned_expiration_time,disburse_year,planned_expiration_year
0,125.0000,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,2013,2014
1,400.0000,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,2013,2014
2,400.0000,2014-01-09 08:00:00+00:00,2014-02-15 21:10:05+00:00,2014,2014
3,625.0000,2014-01-17 08:00:00+00:00,2014-02-21 03:10:02+00:00,2014,2014
4,425.0000,2013-12-17 08:00:00+00:00,2014-02-13 06:10:02+00:00,2013,2014

time: 9.77 s

Bisogna però prestare attenzione alla colonna `duration` del dataframe `loans`. Questa infatti deve essere ricalcolata poiché intesa in modo diverso nel punto 2 rispetto a come riportato nell'esempio del punto 12.

Se si considerano infatti le date 01/12/2016 (`disburse_time`) e 30/01/2018 (`planned_expiration_time`), i giorni che intercorrono sono 31+365+30=426, come riportato sopra.

Se si facesse una semplice differenza con `pd.to_datetime`, questo sarebbe il risultato:

In [60]:
pd.to_datetime('2018-01-30')-pd.to_datetime('2016-12-01')

Timedelta('425 days 00:00:00')

time: 12 ms

Per risolvere il problema verrà si incrementerà semplicemente di 1 `duration`. 

Si calcola quindi `duration` come spiegato precedentemente, considerando solo le date e non le informazioni riguardanti le ore:

In [61]:
loans_reduced['duration'] = (loans_reduced['planned_expiration_time'].dt.date- loans_reduced['disburse_time'].dt.date).dt.days + 1

time: 6.44 s

In [62]:
loans_reduced.head()

,loan_amount,disburse_time,planned_expiration_time,disburse_year,planned_expiration_year,duration
0,125.0000,2013-12-22 08:00:00+00:00,2014-02-14 03:30:06+00:00,2013,2014,55
1,400.0000,2013-12-20 08:00:00+00:00,2014-03-26 22:25:07+00:00,2013,2014,97
2,400.0000,2014-01-09 08:00:00+00:00,2014-02-15 21:10:05+00:00,2014,2014,38
3,625.0000,2014-01-17 08:00:00+00:00,2014-02-21 03:10:02+00:00,2014,2014,36
4,425.0000,2013-12-17 08:00:00+00:00,2014-02-13 06:10:02+00:00,2013,2014,59

time: 12.4 ms

Ci si chiede inoltre quale siano il primo e l'ultimo anno che compaiono nelle date dei prestiti:

In [63]:
print(loans_reduced['disburse_time'].dt.year.loc[loans_reduced['disburse_time'].dt.year.idxmin()])
print(loans_reduced['planned_expiration_time'].dt.year.loc[loans_reduced['planned_expiration_time'].dt.year.idxmax()])

2011
2018
time: 211 ms

Viene costruito quindi un dataframe vuoto che ha come indici i diversi anni, in modo da riempirlo successivamente:

In [64]:
total_amount = pd.DataFrame({"year":list(range(2011,2019)), "amount":np.zeros((8,), dtype=int)})
total_amount = total_amount.set_index('year')
total_amount

      amount
year
2011       0
2012       0
2013       0
2014       0
2015       0
2016       0
2017       0
2018       0

time: 12.6 ms

Di seguito il codice che permette di svolgere quanto visto nell'esempio. Distinguiamo 3 casi:

- `disburse_time` e `planned_expiration_time` sono nello stesso anno. Quindi basterà distribuire `loan_amount` nell'anno del prestito
- `disburse_time` e `planned_expiration_time` sono a cavallo tra due anni diversi. In questo caso vengono calcolati i numeri di giorni tra `disburse_time` e la fine dell'anno e quelli tra la fine dell'anno e `planned_expiration_time`. Poi viene distribuito `loan_amount` in base a quanto calcolato.
- `disburse_time` e `planned_expiration_time` sono a più di un anno di distanza. Essenzialmente il ragionamento rimane simile a quello del caso precedente, con l'aggiunta dei giorni trascorsi tra la fine dell'anno precedente e la fine di quello successivo. L'esempio iniziale ricade in questo caso.

Utilizzando la differenza tra le date, Pandas gestisce automaticamente gli anni bisestili.

In [65]:
for i in range(len(loans_reduced)):
    
    duration = loans_reduced['duration'][i]
    amount = loans_reduced['loan_amount'][i]
    date_range = pd.date_range(start=loans_reduced['disburse_time'][i], end=loans_reduced['planned_expiration_time'][i], freq='Y')

    if len(date_range) == 0: #caso 1: il prestito è nello stesso anno
        
        total_amount.loc[loans_reduced['disburse_time'][i].year] += (((loans_reduced['planned_expiration_time'][i]-loans_reduced['disburse_time'][i]).days+1)/duration)*amount
    
    else: #caso 2: il prestito è inferiore ad un anno ed è a cavallo tra due anni
        
        total_amount.loc[loans_reduced['disburse_time'][i].year] += (((date_range[0]-loans_reduced['disburse_time'][i]).days+1)/duration)*amount
        total_amount.loc[loans_reduced['planned_expiration_time'][i].year] += (((loans_reduced['planned_expiration_time'][i]-date_range[len(date_range)-1]).days+1)/duration)*amount
        
        if len(date_range) != 1: #caso 3: il prestito è superiore ad un anno
            
            for j in range(len(date_range)-1):
                
                total_amount.loc[date_range[j].year + 1] += ((date_range[j+1]-date_range[j]).days/duration)*amount

time: 34min 25s

In [66]:
total_amount

             amount
year
2011    663540.4855
2012 112728252.7243
2013 123367293.3813
2014 150147418.6267
2015 154721205.7295
2016 153335891.2628
2017 164516317.1824
2018   5188997.3768

time: 5.84 ms

***

###  <span style="color:#3282b8"> 13. For each value of repayment_interval, add a new column to the lenders dataframe that contains the total amount of money corresponding to loans in such state

In [67]:
pd.options.display.float_format = '{:.2f}'.format

time: 1.3 ms

Innanzitutto si osservano i possibili valori che può assumere la variabile `repayment_interval`.

In [68]:
loans['repayment_interval'].value_counts()

monthly      777971
irregular    529446
bullet       111568
weekly          622
Name: repayment_interval, dtype: int64

time: 129 ms

Si considera il dataframe `loan_lent` del punto 8 e si effettua un left join con `loans`, che contiene la colonna di interesse `repayment_interval`.

In [69]:
repay = pd.merge(loans[['loan_id','repayment_interval']], loan_lent[['loan_id','lenders','ind_share']], how='left', on='loan_id')

time: 20.1 s

Si raggruppano i lenders in base al valore della variabile `repayment_interval` e si utilizza il comando unstack per ottenere una nuova colonna per ogni suo valore. Si rinominano le colonne, si resettano gli indici e si ottiene il dataframe `repay`.

In [70]:
repay = repay.groupby(['lenders','repayment_interval']).sum()['ind_share'].unstack(fill_value=0, level="repayment_interval")
repay.columns=["bullet","irregular","monthly","weekly"]
repay = repay.reset_index()
repay.head()

           lenders  bullet  irregular  monthly  weekly
0              000  143.34     306.65  1222.63    0.00
1            00000  106.51     550.24   723.00    0.00
2             0002  209.41    1165.27  1097.88    0.00
3         00mike00    0.00       0.00    52.63    0.00
4   0101craign0101  126.16     531.02  1966.39    0.00

time: 29.6 s

Si unisce tramite un left join il dataframe `repay` al dataframe `lenders` e si visualizzano quelli che non assumono valori NaN.

In [71]:
lenders = pd.merge(lenders,repay,how='left',left_on=['permanent_name'],right_on=['lenders'])

time: 5.69 s

In [72]:
lenders[~lenders.bullet.isna()]

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited,lenders,bullet,irregular,monthly,weekly
16,naresh2074,Naresh,NaN,NaN,US,1461303119,NaN,NaN,3.00,NaN,0,naresh2074,26.92,36.76,0.00,0.00
47,jinxian2217,jinxian,NaN,NaN,NaN,1461302938,NaN,NaN,5.00,NaN,0,jinxian2217,0.00,0.00,77.78,0.00
48,sreedevi9583,Sreedevi,NaN,NaN,NaN,1461303004,NaN,NaN,3.00,NaN,0,sreedevi9583,0.00,0.00,32.50,0.00
51,nicole98153893,Nicole,NaN,NaN,NaN,1461303247,NaN,NaN,3.00,NaN,0,nicole98153893,0.00,0.00,50.00,0.00
54,prashankpradeep8456,Prashank Pradeep,NaN,NaN,US,1461300411,NaN,NaN,2.00,NaN,1,prashankpradeep8456,0.00,0.00,30.00,0.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2349140,lacey4240,Lacey,Austin,Tx,US,1342098694,NaN,NaN,1.00,Dana,0,lacey4240,0.00,28.17,0.00,0.00
2349151,barry6472,Barry,Ferndale,WA,US,1342100739,NaN,NaN,52.00,NaN,0,barry6472,80.36,71.88,31.25,0.00
2349153,bonnie9739,Bonnie,Ft. Lauderdale,Florida,US,1342101126,Elementary School Teacher,it is a direct way for me to make a difference...,549.00,NaN,1,bonnie9739,58.33,57.54,416.45,0.00
2349155,cody7091,Cody,Taylorsville,Utah,US,1342098780,NaN,NaN,1.00,Jeannie,0,cody7091,0.00,26.56,0.00,0.00
2349158,rakhi,Rakhi,New York,New York,US,1342100607,Student,I care.,4.00,NaN,0,rakhi,50.00,0.00,0.00,0.00

time: 822 ms

***

###  <span style="color:#3282b8"> 14. What is the occupation with the highest average amount of money lent (the average must be computed over all lenders with a given occupation)?

La colonna `occupation` del dataset `lenders` viene inizialmente ripulita, poichè presenta numerosi valori privi di significato, come punti interrrogativi, smile, spazi vuoti, punti. 

In primo luogo si esegue un join tra il dataframe `money_lent`, contenente i soldi prestati da ogni lender, e `lenders` , nel quale è presente la colonna `occupation`.

In [73]:
temp4 = pd.merge(money_lent, lenders[['permanent_name','occupation']], left_on="lenders", right_on="permanent_name")

time: 3.85 s

Si inizia ora a pulire la colonna di interesse:

In [74]:
#funzione per rimuovere caratteri speciali
def rm_special_char(string):
    return string.encode('ascii', 'ignore').decode('ascii')

time: 2.48 ms

In [75]:
#faccio una prima pulizia della colonna occupation
temp4 = temp4.drop(columns=['permanent_name']).dropna(subset = ['occupation']) #cancello NaN
temp4['occupation'] = temp4['occupation'].apply(rm_special_char) #cancello emoji e caratteri speciali
temp4['occupation'] = temp4['occupation'].str.strip() #tolgo spazi davanti e dopo le parole
temp4['occupation'] = temp4['occupation'].str.title() #metto tutto con prima lettera maiuscola
#elimino smile nelle occupazioni
temp4 = temp4[~temp4['occupation'].str.contains('(\:\w+\:|\<[\/\\]?3|[\(\)\\\D|\*\$][\-\^]?[\:\;\=]|[\:\;\=B8][\-\^]?[3DOPp\@\$\*\\\)\(\/\|])(?=\s|[\!\.\?]|$)', regex=True)]
temp4 = temp4[temp4['occupation'] != ''] #rimuovo lavoro vuoto

temp4

/opt/anaconda3/lib/python3.7/site-packages/pandas/core/strings.py:1843: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

                  lenders  ind_share                     occupation
57                0819212    1947.68                         Banker
69      0lauramelania9158      56.78               Business Analyst
71                0x04b1d      34.38  Software And Systems Engineer
77           101cookbooks     143.27                      Publisher
82             10yearitch     710.74           India Travel Company
...                   ...        ...                            ...
287561             zyrorl     111.70             Software Developer
287562              zzaba      28.12                        Student
287563             zzaman     329.80              Software Engineer
287566            zzinnia      38.00                   I Make Books
287567           zzmcfate    2041.68                   Photographer

[97645 rows x 3 columns]

time: 539 ms

Si nota che molto spesso una stessa tipologia di occupazione viene riportata in modi diversi. Per questo motivo si cerca di uniformare lavori dello stesso tipo, andando ad individuare quelle occupazioni che contengono parole maggiormente indicative. Ovviamente, questo viene eseguito solo per le professioni più comuni, a causa della notevole diversità dei valori assunti da questa variabile.

In [76]:
#creo lista con lavori
jobs = ['Student','Teacher','Engineer','Retired','Doctor','Artist','Manager','Consultant','Banker','Entrepreneur','Actor']

for job in jobs:
    temp4.loc[temp4['occupation'].str.contains(job), 'occupation'] = job

temp4.loc[temp4['occupation'].str.contains('Grade'), 'occupation'] = 'Student'

temp4

                  lenders  ind_share            occupation
57                0819212    1947.68                Banker
69      0lauramelania9158      56.78      Business Analyst
71                0x04b1d      34.38              Engineer
77           101cookbooks     143.27             Publisher
82             10yearitch     710.74  India Travel Company
...                   ...        ...                   ...
287561             zyrorl     111.70    Software Developer
287562              zzaba      28.12               Student
287563             zzaman     329.80              Engineer
287566            zzinnia      38.00          I Make Books
287567           zzmcfate    2041.68          Photographer

[97645 rows x 3 columns]

time: 782 ms

Si esegue ora un raggruppamento per occupazione e si calcola la media sulla quantità di soldi prestati. Inoltre, si conta quante volte un'occupazione compare nel dataframe, registrando il valore nella nuova variabile `num`.

In [77]:
temp5 = temp4.groupby('occupation')['ind_share'].mean().reset_index()
temp5.columns = ['occupation','mean_ind_share']
temp5['num'] = temp4.groupby('occupation').count().reset_index().ind_share
temp5

                                occupation  mean_ind_share  num
0                       "Citizen Diplomat"           31.67    1
1                            "Grandmother"          339.09    1
2                                       #6          126.58    1
3                                #Librotax          196.14    1
4       (Web)Designer And Energy Therapist           37.50    1
...                                    ...             ...  ...
19412             Zumba Fitness Instructor          243.22    1
19413                         \\"Parkie\\"           41.18    1
19414           \\"Small Business\\" Owner           25.00    1
19415                  ~ Holistic Creative           50.00    1
19416  ~ Making Our World A Better Place ~           97.05    1

[19417 rows x 3 columns]

time: 133 ms

Si trova l'occupazione con la più alta quantità media di soldi prestati. Tuttavia, come si può notare dal risultato ottenuto (Www.Linkedin.Com/In/Peacekeeper), si tratta di una professione non ben specificata. Per questo motivo, si decide di eliminare tutte quelle occupazioni che sono presenti meno di 10 volte nel dataset, in modo da escludere alcuni valori che potrebbero essere nomi di aziende o descrizioni uniche e non significative di un lavoro. Si calcola quindi nuovamente la professione con la più alta quantita media di soldi prestati. Il risultato questa volta è 'Life Coach'.

In [78]:
temp5.occupation.loc[temp5.mean_ind_share.idxmax()]

'Www.Linkedin.Com/In/Peacekeeper'

time: 5.98 ms

In [79]:
temp5 = temp5.drop(index = temp5[temp5['num']<10].index)
temp5 = temp5.sort_values(by=['mean_ind_share'], ascending = False)
temp5.head(20)

                           occupation  mean_ind_share  num
10125                      Life Coach        44149.74   42
7683                           Healer         5511.18   13
4240                              Dad         2386.36   10
14517           Real Estate Developer         2383.72   22
3992                              Cpa         2155.84  101
33     501(C)3 Non Profit Corporation         2146.29   12
13954              Programmer/Analyst         2042.79   12
8751           Information Technology         1891.87  138
1423                          Banking         1748.40   73
2413                  Catholic Priest         1662.53   10
17994                      Unemployed         1620.72   63
10483               Managing Director         1575.46   44
2792                           Church         1460.29   35
9176                      Investments         1271.53   17
1411                    Bank Employee         1217.77   11
10518                   Manufacturing         1093.78   21
17650                          Trader         1081.93   50
9224                               It         1077.64  322
3722                       Consulting         1071.30   28
17992                     Underwriter         1035.74   14

time: 27.5 ms

In [80]:
temp5.occupation.loc[temp5.mean_ind_share.idxmax()]

'Life Coach'

time: 5.38 ms

***

###  <span style="color:#3282b8"> 15. Cluster the loans according to the year-month of disburse time.

In [81]:
pd.options.display.float_format = '{:.0f}'.format

time: 1.02 ms

Si ricava il mese dalla colonna `disburse_time` del dataframe `loans`. La colonna relativa all'anno è stata già precedentemente costruita al punto 7.

In [82]:
loans['disburse_month'] = pd.to_datetime(loans.disburse_time).dt.month
loans_disb_time = loans[['loan_id','disburse_year','disburse_month']]
loans_disb_time

         loan_id  disburse_year  disburse_month
0         657307           2013              12
1         657259           2013              12
2         658010           2014               1
3         659347           2014               1
4         656933           2013              12
...          ...            ...             ...
1419602   988180           2015              11
1419603   988213           2015              11
1419604   989109           2015              11
1419605   989143           2015              11
1419606   989240           2015              11

[1419607 rows x 3 columns]

time: 798 ms

Si raggruppano i prestiti in base all'anno e al mese.

In [83]:
loans_disb_time = loans_disb_time.groupby(['disburse_year','disburse_month'])['loan_id'].apply(list)
loans_disb_time = pd.DataFrame(loans_disb_time)
loans_disb_time

                                                                        loan_id
disburse_year disburse_month
2005          4               [89, 241, 143, 231, 173, 171, 133, 108, 155, 2...
2006          3                                                           [147]
              5               [406, 350, 399, 377, 349, 313, 347, 317, 312, ...
              6               [457, 439, 436, 470, 438, 372, 477, 393, 448, ...
              7               [480, 514, 532, 497, 527, 390, 494, 548, 559, ...
...                                                                         ...
2017          11              [1427320, 1429865, 1432025, 1433781, 1435004, ...
              12              [1433150, 1435040, 1441153, 1441165, 1436592, ...
2018          1               [1444070, 1432653, 1432432, 1432647, 1402001, ...
              2               [1418468, 1411544, 1431631, 1431467, 1435193, ...
              3               [1429907, 1429527, 1429565, 1429195, 1429510, ...

[145 rows x 1 columns]

time: 446 ms

***

###  <span style="color:#3282b8"> 16. For each country, compute its overall GNI, by multiplying the per capita GNI with its population.

In [84]:
pd.options.display.float_format = '{:.2f}'.format

time: 838 µs

Si considera il dataframe `country_stats`, che include la colonna `gni`. Quest'ultima viene moltiplicata per la colonna `population`, presente sempre nello stesso dataframe, ottendendo in questo modo il GNI totale per ogni paese.

In [85]:
country_stats['country_GNI'] = country_stats['gni']*country_stats['population']
country_stats[['country_name','country_code','country_GNI']]

                 country_name country_code      country_GNI
0                       India           IN 7584412900586.12
1                     Nigeria           NG 1038975343422.20
2                      Mexico           MX 2116095729846.28
3                    Pakistan           PK  991221367944.40
4                  Bangladesh           BD  550242445160.55
..                        ...          ...              ...
169                   Somalia           SO              nan
170  Central African Republic           CF    2737088180.82
171                     Samoa           WS              nan
172                 Palestine           PS              nan
173                    Kosovo           XK              nan

[174 rows x 3 columns]

time: 17.5 ms

È possibile anche ordinare il dataframe in base al valore della nuova variabile `country_GNI`:

In [86]:
country_stats[['country_name','country_code','country_GNI']].sort_values('country_GNI', ascending=False).head(10)

      country_name country_code       country_GNI
7            China           CN 18810682651141.37
6    United States           US 17275869077835.28
0            India           IN  7584412900586.12
13           Japan           JP  4751085902083.71
23         Germany           DE  3695111105174.92
14          Russia           RU  3352957024417.66
45          Brazil           BR  2960411438054.98
9        Indonesia           ID  2653994482975.69
36  United Kingdom           GB  2510322251882.61
42          France           FR  2474772098842.45

time: 16 ms

In [87]:
end = dt.datetime.now()
print(end-start)

0:37:59.919555
time: 2.81 ms